# Titanic analysis(Kaggle)

Predict Survival on the Titanic and get familiar with ML basics

## **Overview** 

The data has been split into two groups:
(두개의 데이터 그룹으로 나눠져 있다)

* training set(train.csv)
* test set(test.cvs)

**The training set** should be used to bulid my machine learning models.
training set은 우리에게 여행객 정보를 제공한다(예를 들어 생존여부, 탑승등급, 성별, 나이 등등). 
또한 kaggle 에서는 새로운 변수들(features)을 만드는것이 가능하다고 명시.

**The test set** should be used to see how well my model performs on unseen data.
test set을 이용하여 내가 만들어낸 모델값의 정확도를 찾아낸다. 즉 침몰하는 타이타닉 호에서의 생존여부를 예상하는것.

In [3]:
import pandas as pd


# 데이터 로드
train = pd.read_csv('/home/nincastle/project/Titanic/train.csv')
test = pd.read_csv('/home/nincastle/project/Titanic/test.csv')

### data chack

In [6]:
train.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [7]:
test.tail(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

## **Data Dictionary**

|**Variable**|**Definition**|**Key**|
|------------|--------------|-------|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|sex|sex||
|Age|Age in Yesrs||
|sibsp|# of siblings / spouses aboard the Titanic||
|parch|# of parents / children aboard the Titanic||
|ticket|Ticket number||
|fare|Passenger fare||
|cabin|Cabin number||
|embarkedPort of Embarkation||C = Cherbourg, Q = Queenstown, S = Southampton

## **Variable Notes**

**pclass**: A proxy of socio-economic status(SES)
- 1st = Upper
- 2nd = Middle
- 3rd = Lower

**sibsp**: The dataset defines family relations in this way..
Sibling = brother, sister, stepbrother, stepsister
Spouse = husband, wife(mistresses and fiancés were ignored)
 
**parch**: The dataset defines family relations in the way..
Parent = mother, father
Child = daughter, son, stepdaughter, stepson
Some Shildren travelled only with a nanny, therefore parch=0 for them.

In [9]:
train.shape
# 981 row = 승객정보 12 column = 변수

(891, 12)

In [10]:
test.shape

(418, 11)

In [12]:
train.info()

# 데이터 확인시 Age, Carbin의 데이터가 유실 또는 누락 상태

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [13]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [15]:
train.isnull().sum()

# pandas 에서 null을 카운트 하여 표시

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [16]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

## 시각화 패키지(visuallization package seaborn)